"""
12. Дано дійсне число - ціна 1 кг цукерок. Вивести вартість 1, 2, ..., 10 кг цукерок.
"""


def main(cost: float):
    if cost > 0:
        n = 10
        i = 1
        while n > 0:
            print(f'{i} кг цукерок коштує {cost * i} грн')
            i += 1
            n -= 1
    else:
        print(f'Невірно введена ціна')


if __name__ == '__main__':
    _cost = float(input(f'Введіть вартість 1 кг цукерок\nЦіна за кілограмм '))
    main(_cost)
